app/Http/Requests/RegisterRequest.php

insert into "users" ("name", "email", "password", "updated_at", "created_at") values ('gustav', 'gustavo@email.com', '$2y$12$LVdfAJTLesP8GwBEZ9.f.eR4z35ym68qM1kvDvRfxICLp4vWSIIEu', '2025-05-09 14:12:58', '2025-05-09 14:12:58')
---
    public function tryToRegister() {





       $user = User::query()->create($this->validated());