app/Http/Controllers/DashboardController.php

    public function __invoke()

    {
        /** @var user $user */

        $user = Auth::user();


        return view('dashboard', [
            'user' => $user,
            'links' => $user->links()->orderBy('sort')
                ->get()
---
select * from "links" where "links"."user_id" = 11 and "links"."user_id" is not null order by "sort" asc