app/Http/Controllers/LinkController.php

  public function store(StoreLinkRequest $request)
  {

    /** @var User $user */

    $validated = $request->validated();


    $data = array_merge($validated, ['user_id' =>
    auth::id()]);


    Link::create($data);
---
insert into "links" ("link", "name", "user_id", "updated_at", "created_at") values ('https://github.com/Guhaugusto', 'Github', 12, '2025-05-09 14:34:06', '2025-05-09 14:34:06')

  public function destroy(Link $link)
  {
    $link->delete();
---
delete from "links" where "id" = 76

  public function up(Link $link)
  {
      $order = $link->sort;
      $newOrder = $order - 1;

      /** @var User $user */
      $user = Auth::user();

      $swapWith = $user->links()->where('sort', '=', $newOrder)->first();

      if ($swapWith) {
          $link->fill(['sort' => $newOrder])->save();
          $swapWith->fill(['sort' => $order])->save();
---
update "links" set "sort" = 7, "updated_at" = '2025-05-09 13:34:39' where "id" = 73

  public function down(Link $link)
  {
      $order = $link->sort;
      $newOrder = $order + 1; // Fix: going "down" should increase sort order

      /** @var User $user */
      $user = Auth::user();

      $swapWith = $user->links()->where('sort', '=', $newOrder)->first();

      if ($swapWith) {
          $link->fill(['sort' => $newOrder])->save();
          $swapWith->fill(['sort' => $order])->save();
---
select * from "links" where "links"."user_id" = 11 and "links"."user_id" is not null and "sort" = 7 limit 1
update "links" set "sort" = 8, "updated_at" = '2025-05-09 13:34:39' where "id" = 68
update "links" set "sort" = 6, "updated_at" = '2025-05-09 13:29:53' where "id" = 74