app/Http/Controllers/ProfileController.php

    public function update( ProfileRequest $request)
    {
        $user = auth::user();


        $user->fill($request->validated())->save();
---
update "users" set "name" = 'Gustavo', "handler" = '@gustavoaugusto', "description" = 'Busco adquirir conhecimento e experiência em desenvolvimento de software, utilizando minhas habilidades em PHP e outras tecnologias para contribuir com o desenvolvimento de projetos inovadores e desafiadores,', "photo" = 'photos/Qy59M316TvY15fTG4NxXCZZNVj7SyECmLwFqiOcK.webp', "updated_at" = '2025-05-09 14:29:30' where "id" = 12